# InsertOverlapsOrOut Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..InfillFailures..::..InsertOverlapsOrOut Property
BuiltInFailures..::..InfillFailures Class See Also
---
Highlighted inserts overlap with other inserts or completely miss their hosts.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InsertOverlapsOrOut { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InsertOverlapsOrOut As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InsertOverlapsOrOut {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..InfillFailures Class
Autodesk.Revit.DB Namespace